<figure class="table"><table><tbody><tr><td><h1><strong>Database Setup</strong></h1></td></tr></tbody></table></figure>

## Import required Python Libraries and Modules

In [ ]:
# !pip install ipython-sql sqlite3
# ignore if already installed

import sqlite3
import pandas as pd

### Load the SQL magic extension

In [ ]:
%load_ext sql

### Create Database

In [ ]:
# Enter name of database to create
%sql sqlite:///PizzaShop.db

### Create Database Tables

<p>1. Create a table ' <strong>order_details</strong>' with following schema: </p>
<figure class="table">
  <table>
    <tbody>
      <tr>
        <td>
          <strong>No.</strong>
        </td>
        <td>
          <strong>Column</strong>
        </td>
        <td>
          <strong>Attribute</strong>
        </td>
        <td>
          <strong>Data Type</strong>
        </td>
        <td>
          <strong>Limit</strong>
        </td>
        <td>
          <strong>Primary Key</strong>
        </td>
      </tr>
      <tr>
        <td>
          <strong>1</strong>
        </td>
        <td>Order Details ID</td>
        <td>order_details_id</td>
        <td>INTEGER</td>
        <td>6</td>
        <td>Yes</td>
      </tr>
      <tr>
        <td>
          <strong>2</strong>
        </td>
        <td>Order ID</td>
        <td>order_id</td>
        <td>INTEGER</td>
        <td>6</td>
        <td>-</td>
      </tr>
      <tr>
        <td>
          <strong>3</strong>
        </td>
        <td>Pizza ID</td>
        <td>pizza_id</td>
        <td>TEXT</td>
        <td>40</td>
        <td>-</td>
      </tr>
      <tr>
        <td>
          <strong>4</strong>
        </td>
        <td>Quantity</td>
        <td>quantity</td>
        <td>INTEGER</td>
        <td>3</td>
        <td>-</td>
      </tr>
    </tbody>
  </table>
</figure>
</table>

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS order_details (
    order_details_id INTEGER PRIMARY KEY,
    order_id INTEGER,
    pizza_id TEXT,
    quantity INTEGER
);

<p>2. Create a table '<strong>orders</strong>&nbsp;with following schema:</p><figure class="table"><table><tbody><tr><td><strong>No.</strong></td><td><strong>Column</strong></td><td><strong>Attribute</strong></td><td><strong>Data Type</strong></td><td><strong>Limit</strong></td><td><strong>Primary Key</strong></td></tr><tr><td>1</td><td>Order ID</td><td>order_id</td><td>INTEGER</td><td>6</td><td>Yes</td></tr><tr><td>2</td><td>Date</td><td>order_date</td><td>DATE</td><td>-</td><td>-</td></tr><tr><td>3</td><td>Time</td><td>order_time</td><td>TIME</td><td>-</td><td>-</td></tr></tbody></table></figure>

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS orders (
    order_id INTEGER PRIMARY KEY,
    order_date DATE,
    order_time TIME
);

<p>3. Create a table ‘ <strong>pizza_types</strong>’&nbsp;with following schema: </p>
<figure class="table">
  <table>
    <tbody>
      <tr>
        <td>
          <strong>No.</strong>
        </td>
        <td>
          <strong>Column</strong>
        </td>
        <td>
          <strong>Attribute</strong>
        </td>
        <td>
          <strong>Data Type</strong>
        </td>
        <td>
          <strong>Limit</strong>
        </td>
        <td>
          <strong>Primary Key</strong>
        </td>
      </tr>
      <tr>
        <td>1</td>
        <td>Pizza Type ID</td>
        <td>pizza_type_id</td>
        <td>INTEGER</td>
        <td>6</td>
        <td>Yes</td>
      </tr>
      <tr>
        <td>2</td>
        <td>Name</td>
        <td>name</td>
        <td>TEXT</td>
        <td>255</td>
        <td>-</td>
      </tr>
      <tr>
        <td>3</td>
        <td>Category</td>
        <td>category</td>
        <td>TEXT</td>
        <td>225</td>
        <td>-</td>
      </tr>
      <tr>
        <td>4</td>
        <td>Ingredients</td>
        <td>ingredients</td>
        <td>TEXT</td>
        <td>-</td>
        <td>-</td>
      </tr>
    </tbody>
  </table>
</figure>

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS pizza_types (
    pizza_type_id INTEGER PRIMARY KEY,
    name TEXT,
    category TEXT,
    ingredients TEXT
);

<p>4. Create a table <strong>‘pizzas’</strong>&nbsp;with following schema:</p><figure class="table"><table><tbody><tr><td><strong>No.</strong></td><td><strong>Column</strong></td><td><strong>Attribute</strong></td><td><strong>Data Type</strong></td><td><strong>Limit</strong></td><td><strong>Primary Key</strong></td></tr><tr><td>1</td><td>Pizza ID</td><td>pizza_id</td><td>INTEGER</td><td>6</td><td>Yes</td></tr><tr><td>2</td><td>Pizza Type ID</td><td>pizza_type_id</td><td>INTEGER</td><td>6</td><td>-</td></tr><tr><td>3</td><td>Size</td><td>size</td><td>TEXT</td><td>3</td><td>-</td></tr><tr><td>4</td><td>Price</td><td>price</td><td>INTEGER</td><td>6</td><td>-</td></tr></tbody></table></figure>

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS pizzas (
    pizza_id INTEGER PRIMARY KEY,
    pizza_type_id INTEGER,
    size TEXT,
    price INTEGER
);

### Import data from CSV files into Database tables

In [ ]:
# Connect to the SQLite database
conn = sqlite3.connect('PizzaShop.db')

# Import CSV data into Pandas DataFrame
df1 = pd.read_csv('pizza_sales_csv/order_details.csv')
df2 = pd.read_csv('pizza_sales_csv/orders.csv')
df3 = pd.read_csv('pizza_sales_csv/pizza_types.csv')
df4 = pd.read_csv('pizza_sales_csv/pizzas.csv')

# Write the DataFrame to SQL table
df1.to_sql('order_details', conn, if_exists='replace', index=False)
df2.to_sql('orders', conn, if_exists='replace', index=False)
df3.to_sql('pizza_types', conn, if_exists='replace', index=False)
df4.to_sql('pizzas', conn, if_exists='replace', index=False)

# Close the connection
conn.close()

### Check the data is loaded in the DB tables

In [56]:
%%sql
SELECT * FROM orders
limit 3

 * sqlite:///PizzaShop.db
Done.

[(1, '01-01-2015', '11:38:36'),
 (2, '01-01-2015', '11:57:40'),
 (3, '01-01-2015', '12:12:28')]

<figure class="table"><table><tbody><tr><td><h1><strong>Pizza Sales Analysis</strong></h1></td></tr></tbody></table></figure>

### List all tables in a Database

In [57]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///PizzaShop.db
Done.

[('order_details',), ('orders',), ('pizza_types',), ('pizzas',)]

### 1. Retrieve the total number of orders placed.

In [59]:
%%sql
select count(order_id) as 'Total Orders'
from orders

 * sqlite:///PizzaShop.db
Done.

[(21350,)]

### 2. Calculate the total revenue generated from pizza sales.

In [60]:
%%sql

SELECT ROUND(SUM(od.quantity * pz.price), 2) AS 'Total Revenue'
FROM   order_details AS od
       JOIN pizzas AS pz
         ON od.pizza_id = pz.pizza_id

 * sqlite:///PizzaShop.db
Done.

[(817860.05,)]

### 3. Identify the highest-priced pizza.

In [62]:
%%sql
select 
  name as 'Pizza Name', 
  max(price) as 'Highest Priced Pizza'
from 
  pizzas as pz 
  join pizza_types as pt on pz.pizza_type_id = pt.pizza_type_id

 * sqlite:///PizzaShop.db
Done.

[('The Greek Pizza', 35.95)]

### 4. Identify the most common pizza size ordered.

In [63]:
%%sql

select 
  pz.size, 
  count(od.order_details_id) as common_size_ordered 
from 
  pizzas as pz 
  join order_details as od on pz.pizza_id = od.pizza_id 
group by 
  pz.size 
order by 
  common_size_ordered desc

 * sqlite:///PizzaShop.db
Done.

[('L', 18526), ('M', 15385), ('S', 14137), ('XL', 544), ('XXL', 28)]

### 5. List the top 5 most ordered pizza types along with their quantities.

In [64]:
%%sql

SELECT 
  pizza_types.name, 
  sum(order_details.quantity) as order_quantity_sum 
from 
  pizzas 
  join order_details on pizzas.pizza_id = order_details.pizza_id 
  join pizza_types on pizzas.pizza_type_id = pizza_types.pizza_type_id 
GROUP by 
  pizza_types.name 
ORDER by 
  order_quantity_sum DESC 
limit 
  5

 * sqlite:///PizzaShop.db
Done.

[('The Classic Deluxe Pizza', 2453),
 ('The Barbecue Chicken Pizza', 2432),
 ('The Hawaiian Pizza', 2422),
 ('The Pepperoni Pizza', 2418),
 ('The Thai Chicken Pizza', 2371)]

Note: The GROUP BY clause in SQL is mandatory when you are using aggregate functions (like COUNT(), SUM(), AVG(), MAX(), MIN(), etc.) alongside non-aggregated columns in the SELECT statement.

### 6. Join the necessary tables to find the total quantity of each pizza category ordered.

In [65]:
%%sql

SELECT 
  pizza_types.category, 
  sum(order_details.quantity) as total_category_orders 
from 
  pizzas 
  join order_details on pizzas.pizza_id = order_details.pizza_id 
  join pizza_types on pizzas.pizza_type_id = pizza_types.pizza_type_id 
GROUP by 
  pizza_types.category 
ORDER by 
  total_category_orders DESC

 * sqlite:///PizzaShop.db
Done.

[('Classic', 14888), ('Supreme', 11987), ('Veggie', 11649), ('Chicken', 11050)]

### 7. Determine the distribution of orders by hour of the day.

In [66]:
%%sql
SELECT strftime('%H', order_time) AS hour, COUNT(order_id) as order_count
FROM orders
GROUP BY hour;

 * sqlite:///PizzaShop.db
Done.

[('09', 1),
 ('10', 8),
 ('11', 1231),
 ('12', 2520),
 ('13', 2455),
 ('14', 1472),
 ('15', 1468),
 ('16', 1920),
 ('17', 2336),
 ('18', 2399),
 ('19', 2009),
 ('20', 1642),
 ('21', 1198),
 ('22', 663),
 ('23', 28)]

### 8. Join relevant tables to find the category-wise distribution of pizzas.

In [67]:
%%sql
select 
  category, 
  count(pizza_type_id) as category_count 
from 
  pizza_types 
GROUP by 
  category
order by
  category_count DESC

 * sqlite:///PizzaShop.db
Done.

[('Veggie', 9), ('Supreme', 9), ('Classic', 8), ('Chicken', 6)]

### 9. Group the orders by date and calculate the average number of pizzas ordered per day.

In [70]:
%%sql

select 
  round(
    avg(sum_orders), 
    0
  ) as 'Average orders per day' 
FROM 
  (
    select 
      orders.order_date, 
      sum(order_details.quantity) as sum_orders 
    from 
      orders 
      join order_details on orders.order_id = order_details.order_id 
    GROUP by 
      orders.order_date
  )

 * sqlite:///PizzaShop.db
Done.

[(138.0,)]

### 10. Determine the top 3 most ordered pizza types based on revenue.

In [75]:
%%sql

SELECT 
  pizza_types.name as Name, 
  sum(
    order_details.quantity * pizzas.price
  ) as Revenue 
from 
  order_details 
  JOIN pizzas on pizzas.pizza_id = order_details.pizza_id 
  JOIN pizza_types on pizza_types.pizza_type_id = pizzas.pizza_type_id 
GROUP by 
  Name
order by 
  Revenue DESC 
limit 
  3

 * sqlite:///PizzaShop.db
Done.

[('The Thai Chicken Pizza', 43434.25),
 ('The Barbecue Chicken Pizza', 42768.0),
 ('The California Chicken Pizza', 41409.5)]

### 11. Calculate the percentage contribution of each pizza type to total revenue.

In [76]:
%%sql

SELECT 
  pizza_types.category, 
  round(
    sum(
      order_details.quantity * pizzas.price
    ) / (
      SELECT 
        round(
          sum(
            order_details.quantity * pizzas.price
          ), 
          2
        ) as total_sales 
      FROM 
        order_details 
        JOIN pizzas on pizzas.pizza_id = order_details.pizza_id
    ) * 100, 
    2
  ) as percent_revenue 
from 
  pizza_types 
  join pizzas on pizza_types.pizza_type_id = pizzas.pizza_type_id 
  join order_details on order_details.pizza_id = pizzas.pizza_id 
GROUP by 
  pizza_types.category 
order by 
  percent_revenue desc

 * sqlite:///PizzaShop.db
Done.

[('Classic', 26.91), ('Supreme', 25.46), ('Chicken', 23.96), ('Veggie', 23.68)]

### 12. Analyze the cumulative revenue generated over time.

In [77]:
%%sql

SELECT 
  order_date, 
  round(
    sum(revenue) over (
      order by 
        order_date
    ), 
    2
  ) as Cumulative_Revenue 
from 
  (
    SELECT 
      orders.order_date, 
      sum(
        order_details.quantity * pizzas.price
      ) as revenue 
    from 
      order_details 
      join pizzas on order_details.pizza_id = pizzas.pizza_id 
      join orders on order_details.order_id = orders.order_id 
    group by 
      orders.order_date
  ) as table1

 * sqlite:///PizzaShop.db
Done.

[('01-01-2015', 2713.85),
 ('01-02-2015', 5903.05),
 ('01-03-2015', 7501.6),
 ('01-04-2015', 9678.45),
 ('01-05-2015', 12250.4),
 ('01-06-2015', 15318.15),
 ('01-07-2015', 17549.65),
 ('01-08-2015', 19990.2),
 ('01-09-2015', 22343.05),
 ('01-10-2015', 25545.2),
 ('01-11-2015', 27531.85),
 ('01-12-2015', 29608.55),
 ('02-01-2015', 32340.45),
 ('02-02-2015', 34669.05),
 ('02-03-2015', 37048.1),
 ('02-04-2015', 39595.25),
 ('02-05-2015', 41995.45),
 ('02-06-2015', 44445.4),
 ('02-07-2015', 46740.2),
 ('02-08-2015', 48650.35),
 ('02-09-2015', 50515.9),
 ('02-10-2015', 52590.75),
 ('02-11-2015', 54889.85),
 ('02-12-2015', 57103.95),
 ('03-01-2015', 59766.35),
 ('03-02-2015', 62381.15),
 ('03-03-2015', 64669.05),
 ('03-04-2015', 67207.25),
 ('03-05-2015', 69039.5),
 ('03-06-2015', 70946.55),
 ('03-07-2015', 74389.55),
 ('03-08-2015', 76371.8),
 ('03-09-2015', 78624.4),
 ('03-10-2015', 81025.35),
 ('03-11-2015', 82853.9),
 ('03-12-2015', 85097.1),
 ('04-01-2015', 86852.55),
 ('04-02-2015', 89086.45),
 ('04-03-2015', 91530.75),
 ('04-04-2015', 94298.3),
 ('04-05-2015', 96587.2),
 ('04-06-2015', 98870.8),
 ('04-07-2015', 102735.0),
 ('04-08-2015', 104825.15),
 ('04-09-2015', 107786.1),
 ('04-10-2015', 109928.3),
 ('04-11-2015', 111894.4),
 ('04-12-2015', 114772.75),
 ('05-01-2015', 116838.7),
 ('05-02-2015', 119054.5),
 ('05-03-2015', 121405.15),
 ('05-04-2015', 123315.0),
 ('05-05-2015', 125028.6),
 ('05-06-2015', 127728.75),
 ('05-07-2015', 129320.2),
 ('05-08-2015', 131415.05),
 ('05-09-2015', 133952.85),
 ('05-11-2015', 136133.2),
 ('05-12-2015', 138761.15),
 ('06-01-2015', 141190.1),
 ('06-02-2015', 143700.05),
 ('06-03-2015', 146214.0),
 ('06-04-2015', 148836.35),
 ('06-05-2015', 151146.15),
 ('06-06-2015', 153427.1),
 ('06-07-2015', 155544.0),
 ('06-08-2015', 157643.25),
 ('06-09-2015', 159134.9),
 ('06-10-2015', 161350.85),
 ('06-11-2015', 164508.35),
 ('06-12-2015', 166858.6),
 ('07-01-2015', 169060.8),
 ('07-02-2015', 171298.45),
 ('07-03-2015', 173698.9),
 ('07-04-2015', 175933.15),
 ('07-05-2015', 178162.0),
 ('07-06-2015', 180122.75),
 ('07-07-2015', 182497.15),
 ('07-08-2015', 185123.55),
 ('07-09-2015', 187406.9),
 ('07-10-2015', 189499.25),
 ('07-11-2015', 192080.2),
 ('07-12-2015', 194495.0),
 ('08-01-2015', 197333.35),
 ('08-02-2015', 199368.35),
 ('08-03-2015', 201556.5),
 ('08-04-2015', 203850.45),
 ('08-05-2015', 206902.75),
 ('08-06-2015', 209167.7),
 ('08-07-2015', 211563.75),
 ('08-08-2015', 214280.15),
 ('08-09-2015', 216529.65),
 ('08-10-2015', 218505.5),
 ('08-11-2015', 220615.65),
 ('08-12-2015', 222471.9),
 ('09-01-2015', 224599.25),
 ('09-02-2015', 226794.6),
 ('09-03-2015', 229129.15),
 ('09-04-2015', 231176.45),
 ('09-05-2015', 233544.85),
 ('09-06-2015', 235987.4),
 ('09-07-2015', 238285.15),
 ('09-08-2015', 240287.8),
 ('09-09-2015', 242867.9),
 ('09-10-2015', 245380.5),
 ('09-11-2015', 247864.25),
 ('09-12-2015', 250435.8),
 ('10-01-2015', 252899.75),
 ('10-02-2015', 254956.25),
 ('10-03-2015', 257344.95),
 ('10-04-2015', 259769.9),
 ('10-05-2015', 262058.25),
 ('10-06-2015', 264077.65),
 ('10-07-2015', 266510.05),
 ('10-08-2015', 268649.5),
 ('10-09-2015', 271065.35),
 ('10-10-2015', 273375.55),
 ('10-11-2015', 275418.15),
 ('10-12-2015', 277403.75),
 ('11-01-2015', 279276.05),
 ('11-02-2015', 281736.05),
 ('11-03-2015', 283943.75),
 ('11-04-2015', 286487.5),
 ('11-05-2015', 288875.55),
 ('11-06-2015', 291526.05),
 ('11-07-2015', 293611.6),
 ('11-08-2015', 295901.6),
 ('11-09-2015', 298663.5),
 ('11-10-2015', 300579.75),
 ('11-11-2015', 302525.95),
 ('11-12-2015', 305159.95),
 ('12-01-2015', 307079.0),
 ('12-02-2015', 309237.8),
 ('12-03-2015', 311232.7),
 ('12-04-2015', 313227.0),
 ('12-05-2015', 315526.7),
 ('12-06-2015', 317665.3),
 ('12-07-2015', 319850.95),
 ('12-08-2015', 322216.7),
 ('12-09-2015', 324804.85),
 ('12-11-2015', 327369.65),
 ('12-12-2015', 329329.8),
 ('13-01-2015', 331379.4),
 ('13-02-2015', 334133.9),
 ('13-03-2015', 336920.55),
 ('13-04-2015', 339416.75),
 ('13-05-2015', 341678.55),
 ('13-06-2015', 344187.45),
 ('13-07-2015', 346246.95),
 ('13-08-2015', 348321.1),
 ('13-09-2015', 350159.25),
 ('13-10-2015', 352485.2),
 ('13-11-2015', 354749.75),
 ('13-12-2015', 356994.9),
 ('14-01-2015', 359522.3),
 ('14-02-2015', 361841.45),
 ('14-03-2015', 363880.9),
 ('14-04-2015', 366386.6),
 ('14-05-2015', 369081.1),
 ('14-06-2015', 370940.1),
 ('14-07-2015', 372896.6),
 ('14-08-2015', 375913.2),
 ('14-09-2015', 378078.45),
 ('14-10-2015', 380224.8),
 ('14-11-2015', 382549.55),
 ('14-12-2015', 384722.15),
 ('15-01-2015', 386706.95),
 ('15-02-2015', 388848.2),
 ('15-03-2015', 390916.8),
 ('15-04-2015', 393495.65),
 ('15-05-2015', 396881.8),
 ('15-06-2015', 399477.4),
 ('15-07-2015', 401979.2),
 ('15-08-2015', 404231.55),
 ('15-09-2015', 406781.75),
 ('15-10-2015', 411101.95),
 ('15-11-2015', 412923.6),
 ('15-12-2015', 415311.05),
 ('16-01-2015', 417905.2),
 ('16-02-2015', 419874.0),
 ('16-03-2015', 422169.05),
 ('16-04-2015', 424187.0),
 ('16-05-2015', 426468.1),
 ('16-06-2015', 428366.4),
 ('16-07-2015', 430830.3),
 ('16-08-2015', 432969.6),
 ('16-09-2015', 435154.85),
 ('16-10-2015', 437709.95),
 ('16-11-2015', 439966.6),
 ('16-12-2015', 442201.4),
 ('17-01-2015', 444265.5),
 ('17-02-2015', 446387.4),
 ('17-03-2015', 449352.7),
 ('17-04-2015', 452028.35),
 ('17-05-2015', 453856.75),
 ('17-06-2015', 455993.85),
 ('17-07-2015', 459125.5),
 ('17-08-2015', 461751.5),
 ('17-09-2015', 463993.55),
 ('17-10-2015', 466333.35),
 ('17-11-2015', 468289.9),
 ('17-12-2015', 470170.65),
 ('18-01-2015', 472147.5),
 ('18-02-2015', 474790.35),
 ('18-03-2015', 476865.75),
 ('18-04-2015', 479151.95),
 ('18-05-2015', 481361.6),
 ('18-06-2015', 483346.1),
 ('18-07-2015', 485468.3),
 ('18-08-2015', 487569.5),
 ('18-09-2015', 490291.05),
 ('18-10-2015', 492086.35),
 ('18-11-2015', 494198.05),
 ('18-12-2015', 497084.35),
 ('19-01-2015', 499471.5),
 ('19-02-2015', 501501.75),
 ('19-03-2015', 503890.35),
 ('19-04-2015', 505418.3),
 ('19-05-2015', 507405.3),
 ('19-06-2015', 510198.75),
 ('19-07-2015', 512221.45),
 ('19-08-2015', 514554.4),
 ('19-09-2015', 516840.95),
 ('19-11-2015', 519535.85),
 ('19-12-2015', 521840.05),
 ('20-01-2015', 524237.95),
 ('20-02-2015', 527129.1),
 ('20-03-2015', 529590.35),
 ('20-04-2015', 532049.8),
 ('20-05-2015', 534422.8),
 ('20-06-2015', 536483.4),
 ('20-07-2015', 538984.4),
 ('20-08-2015', 540892.1),
 ('20-09-2015', 542721.1),
 ('20-10-2015', 545158.25),
 ('20-11-2015', 547546.35),
 ('20-12-2015', 549651.25),
 ('21-01-2015', 551691.8),
 ('21-02-2015', 553802.8),
 ('21-03-2015', 556070.2),
 ('21-04-2015', 558283.35),
 ('21-05-2015', 560345.9),
 ('21-06-2015', 562271.1),
 ('21-07-2015', 564301.95),
 ('21-08-2015', 566903.35),
 ('21-09-2015', 569034.8),
 ('21-10-2015', 571495.3),
 ('21-11-2015', 573579.25),
 ('21-12-2015', 575679.95),
 ('22-01-2015', 578176.65),
 ('22-02-2015', 579756.6),
 ('22-03-2015', 581015.85),
 ('22-04-2015', 583209.3),
 ('22-05-2015', 585844.4),
 ('22-06-2015', 588163.7),
 ('22-07-2015', 590455.8),
 ('22-08-2015', 592861.8),
 ('22-09-2015', 595032.2),
 ('22-10-2015', 597433.1),
 ('22-11-2015', 598801.8),
 ('22-12-2015', 600684.75),
 ('23-01-2015', 603108.45),
 ('23-02-2015', 605277.0),
 ('23-03-2015', 607509.55),
 ('23-04-2015', 609935.7),
 ('23-05-2015', 612379.85),
 ('23-06-2015', 614422.6),
 ('23-07-2015', 616637.1),
 ('23-08-2015', 618338.7),
 ('23-09-2015', 620501.7),
 ('23-10-2015', 623112.35),
 ('23-11-2015', 625577.5),
 ('23-12-2015', 627821.8),
 ('24-01-2015', 630111.05),
 ('24-02-2015', 632305.6),
 ('24-03-2015', 634467.9),
 ('24-04-2015', 637447.1),
 ('24-05-2015', 639644.05),
 ('24-06-2015', 641971.55),
 ('24-07-2015', 645175.95),
 ('24-08-2015', 646873.0),
 ('24-10-2015', 649552.5),
 ('24-11-2015', 651782.55),
 ('24-12-2015', 653920.4),
 ('25-01-2015', 655537.95),
 ('25-02-2015', 657879.25),
 ('25-03-2015', 659807.0),
 ('25-04-2015', 661896.2),
 ('25-05-2015', 664000.6),
 ('25-06-2015', 666399.75),
 ('25-07-2015', 668637.0),
 ('25-08-2015', 670595.9),
 ('25-10-2015', 672432.95),
 ('25-11-2015', 674796.2),
 ('26-01-2015', 676680.6),
 ('26-02-2015', 678941.9),
 ('26-03-2015', 681157.4),
 ('26-04-2015', 682924.8),
 ('26-05-2015', 684801.25),
 ('26-06-2015', 687546.75),
 ('26-07-2015', 689418.3),
 ('26-08-2015', 691747.7),
 ('26-09-2015', 693994.55),
 ('26-11-2015', 698400.5),
 ('26-12-2015', 700043.55),
 ('27-01-2015', 702571.6),
 ('27-02-2015', 705429.55),
 ('27-03-2015', 708174.35),
 ('27-04-2015', 710355.15),
 ('27-05-2015', 712452.15),
 ('27-06-2015', 715265.05),
 ('27-07-2015', 717437.05),
 ('27-08-2015', 719554.7),
 ('27-09-2015', 721869.4),
 ('27-10-2015', 723858.05),
 ('27-11-2015', 728280.5),
 ('27-12-2015', 729699.5),
 ('28-01-2015', 731715.5),
 ('28-02-2015', 734255.1),
 ('28-03-2015', 736507.2),
 ('28-04-2015', 738250.0),
 ('28-05-2015', 740266.4),
 ('28-06-2015', 741836.1),
 ('28-07-2015', 743930.65),
 ('28-08-2015', 746577.85),
 ('28-09-2015', 748613.15),
 ('28-10-2015', 750249.1),
 ('28-11-2015', 752217.15),
 ('28-12-2015', 753854.35),
 ('29-01-2015', 755899.65),
 ('29-03-2015', 758053.9),
 ('29-04-2015', 759882.65),
 ('29-05-2015', 762883.85),
 ('29-06-2015', 764757.45),
 ('29-07-2015', 766680.7),
 ('29-08-2015', 768715.7),
 ('29-09-2015', 771477.75),
 ('29-10-2015', 773647.5),
 ('29-11-2015', 775546.5),
 ('29-12-2015', 776899.75),
 ('30-01-2015', 779170.05),
 ('30-03-2015', 781425.5),
 ('30-04-2015', 784093.0),
 ('30-05-2015', 786579.95),
 ('30-06-2015', 788790.9),
 ('30-07-2015', 791140.05),
 ('30-08-2015', 792634.65),
 ('30-09-2015', 794832.7),
 ('30-10-2015', 797569.3),
 ('30-11-2015', 799792.55),
 ('30-12-2015', 801130.35),
 ('31-01-2015', 803548.2),
 ('31-03-2015', 806304.8),
 ('31-05-2015', 808022.45),
 ('31-07-2015', 810117.85),
 ('31-08-2015', 812199.2),
 ('31-10-2015', 814944.05),
 ('31-12-2015', 817860.05)]

### 13. Determine the top 3 most ordered pizza types based on revenue for each pizza category.

In [78]:
%%sql

select 
  category as 'Pizza Category', 
  name as 'Pizza Name', 
  revenue as 'Revenue based on Category' 
from 
  (   select 
      category, 
      name, 
      revenue, 
      rank() over(
        partition by category 
        order by 
          revenue DESC
      ) as rank 
    from 
      (
        select 
          pizza_types.category, 
          pizza_types.name, 
          sum(
            (order_details.quantity)* pizzas.price
          ) as revenue 
        from 
          pizza_types 
          join pizzas on pizza_types.pizza_type_id = pizzas.pizza_type_id 
          join order_details on order_details.pizza_id = pizzas.pizza_id 
        group by 
          pizza_types.category, 
          pizza_types.name
      ) as table1
  ) as table2 
where 
  rank < 4

 * sqlite:///PizzaShop.db
Done.

[('Chicken', 'The Thai Chicken Pizza', 43434.25),
 ('Chicken', 'The Barbecue Chicken Pizza', 42768.0),
 ('Chicken', 'The California Chicken Pizza', 41409.5),
 ('Classic', 'The Classic Deluxe Pizza', 38180.5),
 ('Classic', 'The Hawaiian Pizza', 32273.25),
 ('Classic', 'The Pepperoni Pizza', 30161.75),
 ('Supreme', 'The Spicy Italian Pizza', 34831.25),
 ('Supreme', 'The Italian Supreme Pizza', 33476.75),
 ('Supreme', 'The Sicilian Pizza', 30940.5),
 ('Veggie', 'The Four Cheese Pizza', 32265.7),
 ('Veggie', 'The Mexicana Pizza', 26780.75),
 ('Veggie', 'The Five Cheese Pizza', 26066.5)]

### Learning source:
https://www.youtube.com/watch?v=zZpMvAedh_E&t=2773s